Config/InformationRegisters/НастройкиОбменаФРМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаФРМО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОИД</Name>
					<Comment>Код OID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПодключенияФРМО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКлиентаИПС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОбменЧерезРегион</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СпособыПодключенияФРМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыПодключенияФРМО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегионСервис1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегионЛокальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/НастройкиОбменаФРМО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнятьОбменНаКлиенте(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиОбменаФРМО.ОбменНаКлиенте КАК ОбменНаКлиенте
	|ИЗ
	|	РегистрСведений.НастройкиОбменаФРМО КАК НастройкиОбменаФРМО
	|ГДЕ
	|	НастройкиОбменаФРМО.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Для организации ""%1"" не задана настройка обмена с ФРМО.'"), Организация);
	КонецЕсли;
	
	Возврат Выборка.ОбменНаКлиенте;
	
КонецФункции

Функция ПрямойОбменИПС(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиОбменаФРМО.СпособПодключения КАК СпособПодключения
	|ИЗ
	|	РегистрСведений.НастройкиОбменаФРМО КАК НастройкиОбменаФРМО
	|ГДЕ
	|	НастройкиОбменаФРМО.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Для организации ""%1"" не задана настройка обмена с ФРМО.'"), Организация);
	КонецЕсли;
	
	Возврат (Выборка.СпособПодключения = Перечисления.СпособыПодключенияФРМО.ИПС);
	
КонецФункции

Функция ДанныеНастройкиПодключения(Организация, Токен = Неопределено) Экспорт
	
	ЕстьТокенКлиент = (Токен <> Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НуженСертификат", Не ЕстьТокенКлиент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиОбменаФРМО.ОИД КАК ОИД,
	|	НастройкиОбменаФРМО.СпособПодключения КАК СпособПодключения,
	|	НастройкиОбменаФРМО.АдресСервиса КАК АдресСервиса,
	|	НастройкиОбменаФРМО.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
	|	НастройкиОбменаФРМО.ИдентификаторКлиентаИПС КАК ИдентификаторКлиентаИПС,
	|	НастройкиОбменаФРМО.Логин КАК Логин,
	|	ВЫБОР
	|		КОГДА НастройкиОбменаФРМО.СпособПодключения = ЗНАЧЕНИЕ(Перечисление.СпособыПодключенияФРМО.ИПС)
	|				И &НуженСертификат
	|			ТОГДА НастройкиОбменаФРМО.Сертификат.Программа
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК СертификатПрограмма,
	|	ВЫБОР
	|		КОГДА НастройкиОбменаФРМО.СпособПодключения = ЗНАЧЕНИЕ(Перечисление.СпособыПодключенияФРМО.ИПС)
	|				И &НуженСертификат
	|			ТОГДА НастройкиОбменаФРМО.Сертификат.ДанныеСертификата
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК СертификатДанныеСертификата
	|ИЗ
	|	РегистрСведений.НастройкиОбменаФРМО КАК НастройкиОбменаФРМО
	|ГДЕ
	|	НастройкиОбменаФРМО.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Для организации ""%1"" не задана настройка обмена с ФРМО.'"), Организация);
	КонецЕсли;
	
	////////////////////////////////////////
	
	Настройка = Новый Структура;
	Настройка.Вставить("ИдентификаторОрганизации"	, Выборка.ОИД);
	Настройка.Вставить("ЗащищенноеСоединение"		, Выборка.ЗащищенноеСоединение);
	Настройка.Вставить("Схема"						, "");
	Настройка.Вставить("Хост"						, "");
	Настройка.Вставить("ПутьНаСервере"				, "");
	Настройка.Вставить("Логин"						, Неопределено);
	Настройка.Вставить("Пароль"						, Неопределено);
	Настройка.Вставить("КлючДоступа"				, Неопределено);
	Настройка.Вставить("Токен"						, Неопределено);
	Настройка.Вставить("ДанныеТокена"				, Неопределено);
	
	МетодРегиона = "/hs/fws-proxy/FRMO_FRMR";
	
	Если Выборка.СпособПодключения = Перечисления.СпособыПодключенияФРМО.РегионСервис1С Тогда
		
		ДанныеБХ = ДанныеИзБезопасногоХранилища(Организация);
		
		Настройка.Схема					= "https";
		Настройка.Хост					= "cert.1cfresh.com";
		Настройка.ПутьНаСервере			= "/a/medreg-frmo-frmr" + МетодРегиона;
		Настройка.ЗащищенноеСоединение	= Истина; 
		Настройка.КлючДоступа			= ДанныеБХ.КлючДоступа;
		
	ИначеЕсли Выборка.СпособПодключения = Перечисления.СпособыПодключенияФРМО.РегионЛокальный Тогда
		
		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Выборка.АдресСервиса);
		Схема = ?(Выборка.ЗащищенноеСоединение, "https", "http");
		ДанныеБХ = ДанныеИзБезопасногоХранилища(Организация);
		
		Настройка.Схема					= Схема;
		Настройка.Хост					= СтруктураURI.Хост;
		Настройка.ПутьНаСервере			= СтруктураURI.ПутьНаСервере + МетодРегиона;
		Настройка.КлючДоступа			= ДанныеБХ.КлючДоступа;
		
		Если Не ПустаяСтрока(Выборка.Логин) Тогда
			Настройка.Логин = Выборка.Логин;
			Пароль = ДанныеБХ.Пароль;
		КонецЕсли;
		
	ИначеЕсли Выборка.СпособПодключения = Перечисления.СпособыПодключенияФРМО.ИПС Тогда
		
		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Выборка.АдресСервиса);
		Схема = ?(Выборка.ЗащищенноеСоединение, "https", "http");
		
		Настройка.Схема					= Схема;
		Настройка.Хост					= СтруктураURI.Хост;
		Настройка.ПутьНаСервере			= СтруктураURI.ПутьНаСервере;
		
		Если ЕстьТокенКлиент Тогда
			
			Настройка.Токен = Токен;
			
		Иначе
			
			МенеджерКриптографии = ЭлектроннаяПодпись.МенеджерКриптографии("Подписание", Истина,, Выборка.СертификатПрограмма);
			ДанныеБХ = ДанныеИзБезопасногоХранилища(Организация);
			
			ДанныеТокена = Новый Структура;
			ДанныеТокена.Вставить("АдресСервиса"			, Схема + "://" + СтруктураURI.Хост);
			ДанныеТокена.Вставить("ИдентификаторКлиентаИПС"	, Выборка.ИдентификаторКлиентаИПС);
			ДанныеТокена.Вставить("Сертификат"				, Выборка.СертификатДанныеСертификата.Получить());
			ДанныеТокена.Вставить("Пароль"					, ДанныеБХ.Пароль);
			ДанныеТокена.Вставить("МенеджерКриптографии"	, МенеджерКриптографии);
			
			Настройка.ДанныеТокена = ДанныеТокена;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Настройка;
	
КонецФункции

Функция ДанныеТокенаДляКлиента(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиОбменаФРМО.СпособПодключения КАК СпособПодключения,
	|	НастройкиОбменаФРМО.АдресСервиса КАК АдресСервиса,
	|	НастройкиОбменаФРМО.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
	|	НастройкиОбменаФРМО.ИдентификаторКлиентаИПС КАК ИдентификаторКлиентаИПС,
	|	НастройкиОбменаФРМО.Сертификат.Программа КАК СертификатПрограмма,
	|	НастройкиОбменаФРМО.Сертификат.ДанныеСертификата КАК СертификатДанныеСертификата
	|ИЗ
	|	РегистрСведений.НастройкиОбменаФРМО КАК НастройкиОбменаФРМО
	|ГДЕ
	|	НастройкиОбменаФРМО.Организация = &Организация";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Для организации ""%1"" не задана настройка обмена с ФРМО.'"), Организация);
	КонецЕсли;
	
	Если Выборка.СпособПодключения <> Перечисления.СпособыПодключенияФРМО.ИПС Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеБХ = ДанныеИзБезопасногоХранилища(Организация);
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Выборка.АдресСервиса);
	Схема = ?(Выборка.ЗащищенноеСоединение, "https", "http");
	
	ДанныеТокена = Новый Структура;
	ДанныеТокена.Вставить("АдресСервиса"			, Схема + "://" + СтруктураURI.Хост);
	ДанныеТокена.Вставить("ИдентификаторКлиентаИПС"	, Выборка.ИдентификаторКлиентаИПС);
	ДанныеТокена.Вставить("Сертификат"				, Выборка.СертификатДанныеСертификата.Получить());
	ДанныеТокена.Вставить("Пароль"					, ДанныеБХ.Пароль);
	ДанныеТокена.Вставить("Программа"				, Выборка.СертификатПрограмма);
	
	Возврат ДанныеТокена;
	
КонецФункции

Функция ДанныеИзБезопасногоХранилища(Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Данные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Организация, "НастройкиОбменаФРМОКлючДоступа,НастройкиОбменаФРМОПароль");
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый Структура("КлючДоступа,Пароль", "", "");
	
	Если Данные <> Неопределено Тогда
		Результат.КлючДоступа = Строка(Данные.НастройкиОбменаФРМОКлючДоступа);
		Результат.Пароль = Строка(Данные.НастройкиОбменаФРМОПароль);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДанныеВБезопасноеХранилище(Организация, Данные) Экспорт
	
	СохранитьЗначения = Новый Структура;
	УдалитьЗначения = Новый Массив;
	
	Если Данные.КлючДоступа <> Неопределено Тогда
		Если ЗначениеЗаполнено(Данные.КлючДоступа) Тогда
			СохранитьЗначения.Вставить("НастройкиОбменаФРМОКлючДоступа", Данные.КлючДоступа);
		Иначе
			УдалитьЗначения.Добавить("НастройкиОбменаФРМОКлючДоступа");
		КонецЕсли;
	КонецЕсли;
	
	Если Данные.Пароль <> Неопределено Тогда
		Если ЗначениеЗаполнено(Данные.Пароль) Тогда
			СохранитьЗначения.Вставить("НастройкиОбменаФРМОПароль", Данные.Пароль);
		Иначе
			УдалитьЗначения.Добавить("НастройкиОбменаФРМОПароль");
		КонецЕсли;
	КонецЕсли;
	
	Если СохранитьЗначения.Количество() = 0 И УдалитьЗначения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СохранитьЗначения.Количество() > 0 Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Организация, СохранитьЗначения, Неопределено);
	КонецЕсли;
	Если УдалитьЗначения.Количество() > 0 Тогда
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Организация, СтрСоединить(УдалитьЗначения, ","));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ДанныеОИД(ИНН, КПП) Экспорт
	
	Результат = Новый Структура("ОИД,КодОшибки,СообщениеОбОшибке", "", "", "");
	
	Авторизация = ИнтеграцияФРМО.ТикетИТСДля1СФНСИ();
	
	Если ЗначениеЗаполнено(Авторизация.КодОшибки) Тогда
		Результат.КодОшибки = "ИТС_" + Авторизация.КодОшибки; 
		Результат.СообщениеОбОшибке = Авторизация.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	Отбор = Новый Соответствие;
	Отбор.Вставить("inn", ИНН);
	Если ЗначениеЗаполнено(КПП) Тогда
		Отбор.Вставить("kpp", КПП);
	КонецЕсли;
	
	Данные = ИнтеграцияФРМО.СодержимоеСправочника1СФНСИ("1.2.643.5.1.13.13.11.1461",
		Новый УникальныйИдентификатор(), Авторизация.Тикет,, Отбор);
	
	Если ЗначениеЗаполнено(Данные.КодОшибки) Тогда
		Результат.КодОшибки = "1СФНСИ_" + Данные.КодОшибки;
		Результат.СообщениеОбОшибке = Данные.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Данные.Содержимое);
	ДанныеОИД = ПрочитатьJSON(ЧтениеJSON);
	
	Если ДанныеОИД.list.Количество() = 0 Тогда
		Результат.КодОшибки = "1СФНСИ_НеНайден";
		Результат.СообщениеОбОшибке = НСтр("ru = 'OID организации не найден.'");
		Возврат Результат;
	КонецЕсли;
	
	ОИД = "";
	Для Каждого Поле Из ДанныеОИД.list[0] Цикл
		Если Поле.column = "oid" Тогда
			ОИД = Поле.value;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ОИД) Тогда
		Результат.КодОшибки = "1СФНСИ_Пустой";
		Результат.СообщениеОбОшибке = НСтр("ru = 'OID организации не указан.'");
		Возврат Результат;
	КонецЕсли;
	
	Результат.ОИД = ОИД;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
